
[
  
  {
    "title": "Machine Learning Foundations",
    "date": "2024-08-03",
    "content": [
      {
        "heading": "Introduction",
        "paragraph": [
          "I have been working with LLM models for a while now, and every day I'm fascinated by how good they are becoming. However, they still have plenty of shortcomings.",
          "A few days ago, I realized I have a passion for AI and decided to dive deeper into the field. I started by taking a course on Coursera for ML, and I'm loving it!",
          "I've learned so many things in a short amount of time and finally put the linear algebra course that I took in my first year of university to use. Here is some of what I've learned in a beginner-friendly way."
        ]
      },
      {
        "heading": "Some basics",
        "paragraph": [
          "I'm going to summarize every major topic I've learned, so it might not be too intuitive, but here we go! Keep in mind that I'm still learning these topics and am no expert.",
          "Supervised learning is when the model is trained on labeled data. An example is predicting house prices based on different parameters such as size and the number of bedrooms, given already known house prices and their parameters.",
          "Unsupervised learning is when the model is trained on unlabeled data. An example is clustering similar articles together based on their content. This is different from supervised learning, as there are no labels to guide the model.",
          "Linear regression is a supervised learning algorithm that uses an optimization algorithm like gradient descent or the normal equation to minimize the cost function (the difference between the predicted value and the actual value) and create a line of best fit. This best fit line doesn't have to be a straight line; it could be a polynomial if that would better fit the data."
        ]
      },
      {
        "heading": "Why Linear Algebra?",
        "paragraph": [
          "When I was taking Math 211 at university, I couldn't imagine a use case for linear algebra, but recently I found out it's quite useful. Using matrices and vectors is essential in ML for mapping out parameters, expected values, and performing complex operations on them.",
          "Take the normal equation, for example; linear algebra is fundamental for performing optimization using it. Linear algebra becomes even more useful when the number of parameters increases."
        ]
      }
    ]
  },
  {
    "title": "Prompt Engineering Best Prompts",
    "date": "2024-07-01",
    "content": [
      {
        "heading": "Prompt Engineering",
        "paragraph": "Working at DA, I got to interact with different tweaked LLM models. I got into prompt engineering. Here are some engineered prompts you can copy paste to get optimal responses from a LLM like chatGPT or GeminiAI."
      },
      {
        "heading": "Fitness",
        "paragraph": [
          "I want to create a comprehensive guide to fitness and body aesthetics for men, focusing on gym-based training. Please act as a knowledgeable fitness coach and break down the information into 10 separate responses, covering the following topics in detail:",
          "",
          "1. Foundational Principles: Explain the core principles of muscle growth, fat loss, and overall health improvement.",
          "2. Macronutrients: Detail the role of protein, carbohydrates, and fats in a fitness-oriented diet, including recommended daily intake ranges for men.",
          "3. Protein Deep Dive: Focus specifically on protein – types, sources, optimal timing for consumption, and its crucial role in muscle building.",
          "4. Workout Splits: Explain different workout splits (e.g., full body, push/pull/legs) and their advantages/disadvantages.",
          "5. Exercise Selection: Discuss key compound exercises and isolation exercises for each muscle group, emphasizing proper form and technique.",
          "6. Progressive Overload: Explain the importance of progressively increasing weight, reps, or sets over time to stimulate muscle growth.",
          "7. Rest and Recovery: Highlight the significance of rest days, sleep, and active recovery for muscle repair and growth.",
          "8. Diet Planning Basics: Provide a step-by-step guide to creating a personalized diet plan based on calorie needs and macronutrient ratios.",
          "9. Supplement Considerations: Discuss popular fitness supplements (e.g., creatine, whey protein), their potential benefits and drawbacks, and safe usage.",
          "10. Goal Setting and Tracking Progress: Explain how to set realistic fitness goals, track progress effectively, and stay motivated.",
          "",
          "Please provide specific examples, actionable advice, and clear explanations in each response."
        ]
      },
      {
        "heading": "Lacking Purpose",
        "paragraph": [
          "Universal Prompt (When you feel lost):",
          "",
          "\"I'm feeling lost and lacking direction in my life. Imagine you're a wise mentor who deeply understands me. What activities, skills, or areas of exploration do you think would be worth my time and energy right now? Consider my interests [list a few of your interests] and any skills or knowledge I already possess [mention any relevant skills].\"",
          "",
          "Scenario-Based Prompts:",
          "",
          "1. Feeling unmotivated in the morning: \"I'm struggling to find the motivation to start my day. Can you suggest three small, achievable actions I could take today that might make me feel more accomplished and engaged?\"",
          "2. Unsure of career path: \"I'm feeling uncertain about my career path. Based on my interests in [list interests], skills in [list skills], and values of [list values], what are some potential career paths or fields I should explore?\"",
          "3. Yearning for a creative outlet: \"I'm looking for a creative outlet to express myself. What are some unique or unconventional creative activities you would recommend for someone who enjoys [list hobbies or interests]?\"",
          "4. Wanting to make a difference: \"I want to contribute to the world in a meaningful way but don't know where to start. What are some pressing issues that need attention, and how could someone with my skills and interests [list skills and interests] get involved?\""
        ]
      }
    ]
  },
  {
    "title": " Data Analysis with Python",
    "date": "2024-06-24",
    "image": "https://cdn.pixabay.com/photo/2023/08/05/15/42/panda-8171354_1280.jpg",
    "content": [
      {
        "heading": "My Story",
        "paragraph": [
          "I got into data analysis before I started university. I began exploring this field even before I had fully learned Python. It all started the year after I graduated from high school. Like many others, I was unsure about what I wanted to do with my life. Working out was my main hobby, and I thought, \"Probably Kinesiology.\" I also dreamed of becoming a millionaire and considered studying business.",
          "One day, I had a brilliant idea: Why not do a quick Google search on the best, highest-demand, future-proof careers? Consistently at the top of the list were \"Computer Science,\" \"Data Science,\" and other IT-related fields. This reminded me of when I was first introduced to Scratch at age 10, JavaScript for graphics at 12, and Python at 13. I spent a week or two fiddling with them and found them fun, but I was young and more interested in exploring the world, so I didn't dive deep into any of them.",
          "Deciding to give it another shot, I bought a $15 course on Udemy called \"100 Days of Code.\" I spent the next 30 days focused on this course and was hooked. I loved everything about Python, from its intuitiveness to the speed at which I could create applications from ideas that popped into my head. One of the first applications I created without any guidance turned out to be an application that made me thousands of dollars indirectly. Here’s how it happened:",
          "Long story short, after around 30 days of learning Python, I found a data entry job which I automated using Pandas and PyAutoGUI. I used Pandas to handle the data cleanly, pixel color recognition from PyAutoGUI, and time.sleep to coordinate human-like actions that input data as fast and accurately as possible. Before my Python script, this task was done manually for years, costing the company thousands of dollars and many human hours.s"
        ]
      },
      {
        "heading": "That was my first brush with Pandas.",
        "paragraph": [
          "That's when I realized how powerful Python, the Pandas library, and coding in general are. Before this experience, I was uncertain about going into computer science. After this experience, I was excited and couldn’t wait to get started, to learn more, and to discover everything Pandas had to offer. Fast forward a few years, and I'm working on training data analysis for AI models. I use Pandas daily, making plots with Matplotlib and Seaborn, cleaning up data, and calculating means.",
          "So here's a quick tutorial for Pandas that I'm writing off the top of my head, with no revision."
        ]
      },
      {
        "heading": "Pandas Tutorial",
        "paragraph": [
          "Notice that this will be a quick overview to showcase the power of Pandas as far as I know it. The Pandas library is extremely powerful, and I don't think I've explored all it has to offer yet. So here goes nothing.",
          "Pandas allows you to feed a Python script any Excel-like file, performing an extremely wide range of operations on it. It can process a CSV file (or Excel, TSV, etc.) and creates an object in Python called a DataFrame. Pandas mainly works with two objects: the Series and the DataFrame. The DataFrame is much more common, but the Series is important too. The Series is very similar to a Python array, while the DataFrame is akin to a 2D Python array. Here is how every data analysis project typically starts:",
          "`df = pd.read_csv(path)` This line of code is extremely common in any Python script that uses Pandas. It simply reads a CSV file provided by the path variable and turns it into a DataFrame so that you can work with it in Python. It is the gateway from an Excel sheet into Python code.",
          "After that, you usually want to inspect the data to understand it better. You could use the following lines of code:",
          "`df.info()` This displays all columns and their types. Sometimes you might think a column is of a numerical type but find out it's of an object type. You would have to convert object types to numerical types often if you want to work with numbers to extract values such as average or median.",
          "`df.head(10).to_markdown()` I personally find this line of code very useful in PyCharm. It displays the first 10 rows of the DataFrame in Markdown, which means it will look nice and clean. I prefer this sometimes to looking at the data in Excel.",
          "Now, say one of the columns is called Total and has 30 entries representing the total price of different items. If you would like to find the average price of all 30 items, you would do something like this:",
          "`avg = df[\"Total\"].mean()` `print(avg)`",
          "You have now used Pandas to perform a complex calculation on an Excel sheet. This is barely scratching the surface of what Pandas is capable of. For example, other capabilities of Pandas include data cleaning, data manipulation, handling missing data, merging datasets, and supporting time series analysis, which means it can comprehend a wide range of time formats (with the help of the datetime library), etc. Every day, I aim to become a better data analyst, and every day, I find pandas a little cuter ;) I might drop a more advanced data analysis blog soon as I settle more in the career of data analysis or data science, so stay tuned."
        ]
      },
      {
        "image": "https://images.seattletimes.com/wp-content/uploads/2021/02/panda-050c061c-60de-11eb-9061-07abcc1f9229.jpg?d=1020x680"
      }
    ]
  }
]
